---
kind: property
id: P:Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureOffsetLock
source: html/c3949960-57e9-af40-9089-b98358d262b6.htm
---
# Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureOffsetLock Property

The property labeled "Offset Lock" from the "UnifiedBitmap" schema.

## Syntax (C#)
```csharp
public static string TextureOffsetLock { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".